Documents/бит_СвидетельствоОРегистрацииПоМестуПроживания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>бит_СвидетельствоОРегистрацииПоМестуПроживания</Name>
			<BasedOn>
				<xr:Item>Document.бит_ЗаявлениеОРегистрацииПоМестуПЖ</xr:Item>
			</BasedOn>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бит_ЗаявлениеОРегистрацииПоМестуПЖ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретитьВвод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтборПоВидуОперации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрируемоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/бит_ФИОПроживающих.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ФИОПроживающих</Name>
			<Comment>БИТ</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/бит_ПаспортныеДанныеПроживающих.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ПаспортныеДанныеПроживающих</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДокументВид</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ДокументыУдостоверяющиеЛичность</v8:Type>
						<v8:Type>cfg:CatalogRef.УдалитьДокументыУдостоверяющиеЛичность</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументСерия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументКемВыдан</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументКодПодразделения</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРегистрацииПоМестуЖительства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументПричинаЗамены</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/бит_СвидетельствоОРегистрацииПоМестуПроживания/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	&НаСервере
	Функция ПолучитьИнициалы(Строка)
		
		Если НЕ ПустаяСтрока(Строка) Тогда
			
			Если СтрНайти(Строка, ".") Тогда
				Возврат Строка;
			КонецЕсли;
			
			ФИО = СтрРазделить(Строка, " ", Ложь);
			
			Отчество = "";
			Фамилия = "";
			Имя = "";
			
			Если ФИО.Количество() = 3 Тогда
				Фамилия = ФИО[0];
				Имя = ФИО[1];
				Отчество = ФИО[2];
			ИначеЕсли ФИО.Количество() = 2 Тогда
				Фамилия = ФИО[0];
				Имя = ФИО[1];	
			Иначе
				Фамилия = ФИО[0];
			КонецЕсли;
			
			ФамилияИнициалы = Фамилия 
			+?(ЗначениеЗаполнено(Имя), " " + Лев(Имя,1), "") 
			+?(ЗначениеЗаполнено(Отчество),". " + Лев(Отчество,1)+".", ""); 	
			
			Возврат ФамилияИнициалы;
		КонецЕсли;
		Возврат "";
	КонецФункции
	
	#Область Печать
	
	// БИТ_ЖКХ Функция.
	//
	// Параметры:
	//
	//
	// Возвращаемое значение:
	//  Результат – Строка.
	//
	Функция Печать(Документ) Экспорт
		
		Результат = Новый Структура;
		Результат.Вставить("НетОшибок"        , Истина);
		Результат.Вставить("СообщениеОбОшибке", "");
		Результат.Вставить("ТабДокумент"      , Новый ТабличныйДокумент);
		
		Запрос = Новый Запрос();
		Запрос.УстановитьПараметр("Ссылка" ,Документ);
		Запрос.УстановитьПараметр("Момент" ,КонецДня(Документ.Дата));
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СвидетельствоОРегистрацииПоМестуПроживания.Организация,
		|	СвидетельствоОРегистрацииПоМестуПроживания.Ответственный,
		|	СвидетельствоОРегистрацииПоМестуПроживания.Комментарий,
		|	СвидетельствоОРегистрацииПоМестуПроживания.ЛицевойСчет,
		|	СвидетельствоОРегистрацииПоМестуПроживания.РегистрируемоеЛицо,
		|	ФИОФизЛицСрезПоследних.Фамилия,
		|	ФИОФизЛицСрезПоследних.Имя,
		|	ФИОФизЛицСрезПоследних.Отчество,
		|	СвидетельствоОРегистрацииПоМестуПроживания.ЛицевойСчет.УлицаЛицевогоСчета КАК УлицаРег,
		|	СвидетельствоОРегистрацииПоМестуПроживания.ЛицевойСчет.Здание КАК ДомРег,
		|	СвидетельствоОРегистрацииПоМестуПроживания.ЛицевойСчет.Квартира КАК КвартираРег,
		|	СвидетельствоОРегистрацииПоМестуПроживания.ЛицевойСчет.Здание.Корпус КАК КорпусРег,
		|	СвидетельствоОРегистрацииПоМестуПроживания.ЛицевойСчет.Здание.ПочтовыйАдрес КАК ПочтовыйАдрес,
		|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументВид КАК ВидДокумента,
		|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументСерия КАК СерияДокумента,
		|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументНомер КАК НомерДокумента,
		|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументДатаВыдачи КАК ДатаВыдачиДокумента,
		|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументКемВыдан КАК ВыданДокумент,
		|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументКодПодразделения,
		|	ПаспортныеДанныеФизЛицСрезПоследних.ДатаРегистрацииПоМестуЖительства,
		|	ПаспортныеДанныеФизЛицСрезПоследних1.ДокументВид КАК ВидДокументаПред,
		|	ПаспортныеДанныеФизЛицСрезПоследних1.ДокументСерия КАК СерияДокументаПред,
		|	ПаспортныеДанныеФизЛицСрезПоследних1.ДокументНомер КАК НомерДокументаПред,
		|	ПаспортныеДанныеФизЛицСрезПоследних1.ДокументДатаВыдачи КАК ДатаВыдачиПред,
		|	ПаспортныеДанныеФизЛицСрезПоследних1.ДокументКемВыдан КАК ВыданДокументПред,
		|	ПОДСТРОКА(СвидетельствоОРегистрацииПоМестуПроживания.РегистрируемоеЛицо.МестоРождения, 3, 200) КАК МестоРождения,
		|	СвидетельствоОРегистрацииПоМестуПроживания.Номер,
		|	СвидетельствоОРегистрацииПоМестуПроживания.Дата,
		|	СвидетельствоОРегистрацииПоМестуПроживания.ЛицевойСчет.Здание.ПаспортнаяСлужба КАК ПаспортнаяСлужба,
		|	СвидетельствоОРегистрацииПоМестуПроживания.ЛицевойСчет.Здание.ПаспортнаяСлужба.КодПодразделения КАК КодПодразделения
		|ИЗ
		|	Документ.бит_СвидетельствоОРегистрацииПоМестуПроживания КАК СвидетельствоОРегистрацииПоМестуПроживания
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ФИОПроживающих.СрезПоследних(&Момент, ) КАК ФИОФизЛицСрезПоследних
		|		ПО СвидетельствоОРегистрацииПоМестуПроживания.РегистрируемоеЛицо = ФИОФизЛицСрезПоследних.ФизЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПаспортныеДанныеПроживающих.СрезПоследних(&Момент, ) КАК ПаспортныеДанныеФизЛицСрезПоследних
		|		ПО СвидетельствоОРегистрацииПоМестуПроживания.РегистрируемоеЛицо = ПаспортныеДанныеФизЛицСрезПоследних.ФизЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПаспортныеДанныеПроживающих.СрезПоследних(&Момент, ) КАК ПаспортныеДанныеФизЛицСрезПоследних1
		|		ПО СвидетельствоОРегистрацииПоМестуПроживания.Ответственный = ПаспортныеДанныеФизЛицСрезПоследних1.ФизЛицо
		|ГДЕ
		|	СвидетельствоОРегистрацииПоМестуПроживания.Ссылка = &Ссылка";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Количество() = 0 Тогда
			
			Результат.НетОшибок         = Ложь;
			Результат.СообщениеОбОшибке = "Не найдены данные по документу.";
			
		КонецЕсли; 
		
		Выборка.Следующий();
		
		
		ЗапросЗаявление = Новый Запрос;
		ЗапросЗаявление.Текст = "ВЫБРАТЬ
		|	бит_СвидетельствоОРегистрацииПоМестуПроживания.ДокументОснование.ДатаРегистрации КАК ДатаРегистрации,
		|	бит_СвидетельствоОРегистрацииПоМестуПроживания.ДокументОснование.ОрганФМСКудаПрибыл.Руководитель КАК Руководитель,
		|	бит_СвидетельствоОРегистрацииПоМестуПроживания.ДокументОснование.ОрганФМСКудаПрибыл.Должность КАК ДолжностьДЛО
		|ИЗ
		|	Документ.бит_СвидетельствоОРегистрацииПоМестуПроживания КАК бит_СвидетельствоОРегистрацииПоМестуПроживания
		|ГДЕ
		|	бит_СвидетельствоОРегистрацииПоМестуПроживания.Ссылка = &Ссылка";
		ЗапросЗаявление.УстановитьПараметр("Ссылка", Документ);
		
		ВыборкаЗаявление = ЗапросЗаявление.Выполнить().Выбрать();
		
		
		ТабДокумент   = Новый ТабличныйДокумент();
		ТабДокумент.КлючПараметровПечати = "ЗаявлениеОРегистрацииПоМестуПЖ";
		
		Макет         = ПолучитьМакет("СОРПМЖ");
		ШапкаОбласть  = Макет.ПолучитьОбласть("Шапка");
		
		ШапкаОбласть.Параметры.Заполнить(Выборка);
		
		Если ВыборкаЗаявление.Следующий() Тогда
			
			Если ЗначениеЗаполнено(ВыборкаЗаявление.Руководитель) Тогда
				ШапкаОбласть.Параметры.ФИОРуководителя  = ПолучитьИнициалы(ВыборкаЗаявление.Руководитель);
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.ПочтовыйАдрес) Тогда                 
			АдресПрибытия = Строка(Выборка.ПочтовыйАдрес);
		ИначеЕсли ЗначениеЗаполнено(Выборка.ЛицевойСчет) Тогда
			АдресПрибытия = "ул. " + Строка(Выборка.УлицаРег) + ", д. " + Строка(Выборка.ДомРег)
			+ ?(ЗначениеЗаполнено(Выборка.КорпусРег),", корп." + Строка(Выборка.КорпусРег),"");
		КонецЕсли;
		
		АдресПрибытия = Строка(АдресПрибытия) + ?(ЗначениеЗаполнено(Выборка.КвартираРег),", кв." + Строка(Выборка.КвартираРег),"");
		Если ЗначениеЗаполнено(Выборка.РегистрируемоеЛицо) Тогда
			
			Если ЗначениеЗаполнено(Выборка.Фамилия) Тогда
				РегистрируемоеЛицоФИО = Строка(Выборка.Фамилия)+" "+ Строка(Выборка.Имя)+" "+Строка(Выборка.Отчество);
			Иначе
				РегистрируемоеЛицоФИО = Строка(Выборка.РегистрируемоеЛицо);
			КонецЕсли;
						
			РегистрируемоеЛицоФИО = РегистрируемоеЛицоФИО + ?(ЗначениеЗаполнено(Выборка.РегистрируемоеЛицо.ДатаРождения), ", "+Формат(Выборка.РегистрируемоеЛицо.ДатаРождения,"ДФ='dd.MM.yyyy ""г.р""'"), "");
			ШапкаОбласть.Параметры.ФизЛицо = РегистрируемоеЛицоФИО;
			
			Если ЗначениеЗаполнено(Выборка.РегистрируемоеЛицо.МестоРождения) Тогда
				МестоРождения = бит_ПаспортныйСтолКлиетСервер.ПредставлениеМестаРождения(Выборка.РегистрируемоеЛицо.МестоРождения, Истина);
				
				МестоРождения_1 = "";
				МестоРождения_2 = "";
				бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(МестоРождения, 75, МестоРождения_1, МестоРождения_2);
				ШапкаОбласть.Параметры.МестоРождения = МестоРождения_1;
				ШапкаОбласть.Параметры.МестоРождения2 = МестоРождения_2;
			КонецЕсли;
			
			АдресПрибытияРегистрируемого = бит_ПаспортныйСтолСервер.ПолучитьАдресИзКонтактнойИнформации(Выборка.РегистрируемоеЛицо, "Юридический");
			Если НЕ ПустаяСтрока(АдресПрибытияРегистрируемого) тогда
				АдресПрибытия = АдресПрибытияРегистрируемого;
			КонецЕсли;
			
		КонецЕсли; 
		
		АдресПрибытия_1 = "";
		АдресПрибытия_2 = "";
		бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(АдресПрибытия, 71, АдресПрибытия_1, АдресПрибытия_2);
		ШапкаОбласть.Параметры.АдресПрибытия_1 = АдресПрибытия_1;
		ШапкаОбласть.Параметры.АдресПрибытия_2 = АдресПрибытия_2;
		
		Если ЗначениеЗаполнено(Выборка.ВыданДокумент) Тогда
			ВыданДокумент = Строка(Выборка.ВыданДокумент) + ?(ЗначениеЗаполнено(Выборка.ДокументКодПодразделения)," код " + Строка(Выборка.ДокументКодПодразделения) ,"");
			ВыданДокумент_1 = "";
			ВыданДокумент_2 = "";
			бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(ВыданДокумент, 30, ВыданДокумент_1, ВыданДокумент_2);
			ШапкаОбласть.Параметры.ВыданДокумент_1 = ВыданДокумент_1;
			ШапкаОбласть.Параметры.ВыданДокумент_2 = ВыданДокумент_2;
		КонецЕсли; 
		
		Если ЗначениеЗаполнено(Выборка.ДомРег) Тогда
			
			Если ЗначениеЗаполнено(Выборка.ДомРег.ПаспортнаяСлужба) Тогда
				
				ОрганУчета = Строка(Выборка.ПаспортнаяСлужба) + ?(ЗначениеЗаполнено(Выборка.КодПодразделения), " " + Выборка.КодПодразделения, "") ;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЗначениеЗАполнено(ОрганУчета) Тогда		
			ОрганУчета = ОрганУчета 
			+?(ЗначениеЗаполнено(ВыборкаЗаявление.ДолжностьДЛО), ", " + ВыборкаЗаявление.ДолжностьДЛО, "");		
		Иначе			
			ОрганУчета = "" + ОрганУчета 
			+?(ЗначениеЗаполнено(ВыборкаЗаявление.ДолжностьДЛО), "" + ВыборкаЗаявление.ДолжностьДЛО, "");
		КонецЕсли;
		
		ОрганУчета_1 = "";
		ОрганУчета_2 = "";
		бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(ОрганУчета, 35, ОрганУчета_1, ОрганУчета_2);
		ШапкаОбласть.Параметры.ОрганУчета_1 = ОрганУчета_1;
		ШапкаОбласть.Параметры.ОрганУчета_2 = ОрганУчета_2;
		
		
		ШапкаОбласть.Параметры.ДеньВыдачи   = Формат(Выборка.Дата,"ДФ='дд'");;
		ШапкаОбласть.Параметры.МесяцВыдачи  = Сред(Формат(Выборка.Дата,"ДФ=dd.MM.yy"), 4, 2);
		ШапкаОбласть.Параметры.ГодВыдачи    = Формат(Выборка.Дата,"ДФ='yy'");
		
		ТабДокумент.Вывести(ШапкаОбласть);
		
		Результат.ТабДокумент = ТабДокумент;
		
		Возврат Результат;
		
	КонецФункции // ()
	
	
Функция ПечатьДубликат(Документ) Экспорт
		
		Результат = Новый Структура;
		Результат.Вставить("НетОшибок"        , Истина);
		Результат.Вставить("СообщениеОбОшибке", "");
		Результат.Вставить("ТабДокумент"      , Новый ТабличныйДокумент);
		
		Запрос = Новый Запрос();
		Запрос.УстановитьПараметр("Ссылка" ,Документ);
		Запрос.УстановитьПараметр("Момент" ,КонецДня(Документ.Дата));
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СвидетельствоОРегистрацииПоМестуПроживания.Организация,
		|	СвидетельствоОРегистрацииПоМестуПроживания.Ответственный,
		|	СвидетельствоОРегистрацииПоМестуПроживания.Комментарий,
		|	СвидетельствоОРегистрацииПоМестуПроживания.ЛицевойСчет,
		|	СвидетельствоОРегистрацииПоМестуПроживания.РегистрируемоеЛицо,
		|	ФИОФизЛицСрезПоследних.Фамилия,
		|	ФИОФизЛицСрезПоследних.Имя,
		|	ФИОФизЛицСрезПоследних.Отчество,
		|	СвидетельствоОРегистрацииПоМестуПроживания.ЛицевойСчет.УлицаЛицевогоСчета КАК УлицаРег,
		|	СвидетельствоОРегистрацииПоМестуПроживания.ЛицевойСчет.Здание КАК ДомРег,
		|	СвидетельствоОРегистрацииПоМестуПроживания.ЛицевойСчет.Квартира КАК КвартираРег,
		|	СвидетельствоОРегистрацииПоМестуПроживания.ЛицевойСчет.Здание.Корпус КАК КорпусРег,
		|	СвидетельствоОРегистрацииПоМестуПроживания.ЛицевойСчет.Здание.ПочтовыйАдрес КАК ПочтовыйАдрес,
		|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументВид КАК ВидДокумента,
		|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументСерия КАК СерияДокумента,
		|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументНомер КАК НомерДокумента,
		|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументДатаВыдачи КАК ДатаВыдачиДокумента,
		|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументКемВыдан КАК ВыданДокумент,
		|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументКодПодразделения,
		|	ПаспортныеДанныеФизЛицСрезПоследних.ДатаРегистрацииПоМестуЖительства,
		|	ПаспортныеДанныеФизЛицСрезПоследних1.ДокументВид КАК ВидДокументаПред,
		|	ПаспортныеДанныеФизЛицСрезПоследних1.ДокументСерия КАК СерияДокументаПред,
		|	ПаспортныеДанныеФизЛицСрезПоследних1.ДокументНомер КАК НомерДокументаПред,
		|	ПаспортныеДанныеФизЛицСрезПоследних1.ДокументДатаВыдачи КАК ДатаВыдачиПред,
		|	ПаспортныеДанныеФизЛицСрезПоследних1.ДокументКемВыдан КАК ВыданДокументПред,
		|	ПОДСТРОКА(СвидетельствоОРегистрацииПоМестуПроживания.РегистрируемоеЛицо.МестоРождения, 3, 200) КАК МестоРождения,
		|	СвидетельствоОРегистрацииПоМестуПроживания.Номер,
		|	СвидетельствоОРегистрацииПоМестуПроживания.Дата,
		|	СвидетельствоОРегистрацииПоМестуПроживания.ЛицевойСчет.Здание.ПаспортнаяСлужба КАК ПаспортнаяСлужба,
		|	СвидетельствоОРегистрацииПоМестуПроживания.ЛицевойСчет.Здание.ПаспортнаяСлужба.КодПодразделения КАК КодПодразделения
		|ИЗ
		|	Документ.бит_СвидетельствоОРегистрацииПоМестуПроживания КАК СвидетельствоОРегистрацииПоМестуПроживания
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ФИОПроживающих.СрезПоследних(&Момент, ) КАК ФИОФизЛицСрезПоследних
		|		ПО СвидетельствоОРегистрацииПоМестуПроживания.РегистрируемоеЛицо = ФИОФизЛицСрезПоследних.ФизЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПаспортныеДанныеПроживающих.СрезПоследних(&Момент, ) КАК ПаспортныеДанныеФизЛицСрезПоследних
		|		ПО СвидетельствоОРегистрацииПоМестуПроживания.РегистрируемоеЛицо = ПаспортныеДанныеФизЛицСрезПоследних.ФизЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПаспортныеДанныеПроживающих.СрезПоследних(&Момент, ) КАК ПаспортныеДанныеФизЛицСрезПоследних1
		|		ПО СвидетельствоОРегистрацииПоМестуПроживания.Ответственный = ПаспортныеДанныеФизЛицСрезПоследних1.ФизЛицо
		|ГДЕ
		|	СвидетельствоОРегистрацииПоМестуПроживания.Ссылка = &Ссылка";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Количество() = 0 Тогда
			
			Результат.НетОшибок         = Ложь;
			Результат.СообщениеОбОшибке = "Не найдены данные по документу.";
			
		КонецЕсли; 
		
		Выборка.Следующий();
		
		ЗапросЗаявление = Новый Запрос;
		ЗапросЗаявление.Текст = "ВЫБРАТЬ
		|	бит_СвидетельствоОРегистрацииПоМестуПроживания.ДокументОснование.ДатаРегистрации КАК ДатаРегистрации,
		|	бит_СвидетельствоОРегистрацииПоМестуПроживания.ДокументОснование.ОрганФМСКудаПрибыл.Руководитель КАК Руководитель,
		|	бит_СвидетельствоОРегистрацииПоМестуПроживания.ДокументОснование.ОрганФМСКудаПрибыл.Должность КАК ДолжностьДЛО
		|ИЗ
		|	Документ.бит_СвидетельствоОРегистрацииПоМестуПроживания КАК бит_СвидетельствоОРегистрацииПоМестуПроживания
		|ГДЕ
		|	бит_СвидетельствоОРегистрацииПоМестуПроживания.Ссылка = &Ссылка";
		ЗапросЗаявление.УстановитьПараметр("Ссылка", Документ);
		
		ВыборкаЗаявление = ЗапросЗаявление.Выполнить().Выбрать();
		
		ТабДокумент   = Новый ТабличныйДокумент();
		ТабДокумент.КлючПараметровПечати = "ЗаявлениеОРегистрацииПоМестуПЖ";
		
		Макет         = ПолучитьМакет("СОРПМЖ_ДУБЛИКАТ");
		ШапкаОбласть  = Макет.ПолучитьОбласть("Шапка");
		
		ШапкаОбласть.Параметры.Заполнить(Выборка);
		
		Если ВыборкаЗаявление.Следующий() Тогда
			
			Если ЗначениеЗаполнено(ВыборкаЗаявление.Руководитель) Тогда
				ШапкаОбласть.Параметры.ФИОРуководителя  = ПолучитьИнициалы(ВыборкаЗаявление.Руководитель);
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.ПочтовыйАдрес) Тогда                 
			АдресПрибытия = Строка(Выборка.ПочтовыйАдрес);
		ИначеЕсли ЗначениеЗаполнено(Выборка.ЛицевойСчет) Тогда
			АдресПрибытия = "ул. " + Строка(Выборка.УлицаРег) + ", д. " + Строка(Выборка.ДомРег)
			+ ?(ЗначениеЗаполнено(Выборка.КорпусРег),", корп." + Строка(Выборка.КорпусРег),"");
		КонецЕсли;
		
		АдресПрибытия = Строка(АдресПрибытия) + ?(ЗначениеЗаполнено(Выборка.КвартираРег),", кв." + Строка(Выборка.КвартираРег),""); 
		Если ЗначениеЗаполнено(Выборка.РегистрируемоеЛицо) Тогда
			
			Если ЗначениеЗаполнено(Выборка.Фамилия) Тогда
				РегистрируемоеЛицоФИО = Строка(Выборка.Фамилия)+" "+ Строка(Выборка.Имя)+" "+Строка(Выборка.Отчество);
			Иначе
				РегистрируемоеЛицоФИО = Строка(Выборка.РегистрируемоеЛицо);
			КонецЕсли;
						
			РегистрируемоеЛицоФИО = РегистрируемоеЛицоФИО + ?(ЗначениеЗаполнено(Выборка.РегистрируемоеЛицо.ДатаРождения), ", "+Формат(Выборка.РегистрируемоеЛицо.ДатаРождения,"ДФ='dd.MM.yyyy ""г.р""'"), "");
			ШапкаОбласть.Параметры.ФизЛицо = РегистрируемоеЛицоФИО;
			
			Если ЗначениеЗаполнено(Выборка.РегистрируемоеЛицо.МестоРождения) Тогда
				МестоРождения = бит_ПаспортныйСтолКлиетСервер.ПредставлениеМестаРождения(Выборка.РегистрируемоеЛицо.МестоРождения, Истина);
				
				
				МестоРождения_1 = "";
				МестоРождения_2 = "";
				бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(МестоРождения, 75, МестоРождения_1, МестоРождения_2);
				ШапкаОбласть.Параметры.МестоРождения = МестоРождения_1;
				ШапкаОбласть.Параметры.МестоРождения2 = МестоРождения_2;
			КонецЕсли;
			
			
			
			АдресПрибытияРегистрируемого = бит_ПаспортныйСтолСервер.ПолучитьАдресИзКонтактнойИнформации(Выборка.РегистрируемоеЛицо, "Юридический");
			Если НЕ ПустаяСтрока(АдресПрибытияРегистрируемого) тогда
				АдресПрибытия = АдресПрибытияРегистрируемого;
			КонецЕсли;
			
		КонецЕсли; 
		
		АдресПрибытия = АдресПрибытия +
		?(ЗначениеЗаполнено(ВыборкаЗаявление.ДатаРегистрации), " с" + Символы.НПП + Формат(ВыборкаЗаявление.ДатаРегистрации, "ДФ=dd.MM.yyyy"), "");//НПП необходим для невозможности переноса строки между предлогом и датой. 
		АдресПрибытия_1 = "";
		АдресПрибытия_2 = "";
		бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(АдресПрибытия, 69, АдресПрибытия_1, АдресПрибытия_2);
		ШапкаОбласть.Параметры.АдресПрибытия_1 = АдресПрибытия_1;
		ШапкаОбласть.Параметры.АдресПрибытия_2 = АдресПрибытия_2;
		
		Если ЗначениеЗаполнено(Выборка.ВыданДокумент) Тогда
			ВыданДокумент = Строка(Выборка.ВыданДокумент) + ?(ЗначениеЗаполнено(Выборка.ДокументКодПодразделения)," код " + Строка(Выборка.ДокументКодПодразделения) ,"");
			ВыданДокумент_1 = "";
			ВыданДокумент_2 = "";
			бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(ВыданДокумент, 30, ВыданДокумент_1, ВыданДокумент_2);
			ШапкаОбласть.Параметры.ВыданДокумент_1 = ВыданДокумент_1;
			ШапкаОбласть.Параметры.ВыданДокумент_2 = ВыданДокумент_2;
		КонецЕсли; 
		
		Если ЗначениеЗаполнено(Выборка.ДомРег) Тогда
			
			Если ЗначениеЗаполнено(Выборка.ДомРег.ПаспортнаяСлужба) Тогда
				
				ОрганУчета = Строка(Выборка.ПаспортнаяСлужба) + ?(ЗначениеЗаполнено(Выборка.КодПодразделения), " " + Выборка.КодПодразделения, "") ;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЗначениеЗАполнено(ОрганУчета) Тогда		
			ОрганУчета = ОрганУчета 
			+?(ЗначениеЗаполнено(ВыборкаЗаявление.ДолжностьДЛО), ", " + ВыборкаЗаявление.ДолжностьДЛО, "");		
		Иначе			
			ОрганУчета = "" + ОрганУчета 
			+?(ЗначениеЗаполнено(ВыборкаЗаявление.ДолжностьДЛО), "" + ВыборкаЗаявление.ДолжностьДЛО, "");
		КонецЕсли;
		
		ОрганУчета_1 = "";
		ОрганУчета_2 = "";
		бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(ОрганУчета, 35, ОрганУчета_1, ОрганУчета_2);
		ШапкаОбласть.Параметры.ОрганУчета_1 = ОрганУчета_1;
		ШапкаОбласть.Параметры.ОрганУчета_2 = ОрганУчета_2;
		
		
		ШапкаОбласть.Параметры.ДеньВыдачи   = Формат(Выборка.Дата,"ДФ='дд'");;
		ШапкаОбласть.Параметры.МесяцВыдачи  = Сред(Формат(Выборка.Дата,"ДФ=dd.MM.yy"), 4, 2);
		ШапкаОбласть.Параметры.ГодВыдачи    = Формат(Выборка.Дата,"ДФ='yy'");
		
		ТабДокумент.Вывести(ШапкаОбласть);
		
		Результат.ТабДокумент = ТабДокумент;
		
		Возврат Результат;
		
	КонецФункции // ()
	

	#КонецОбласти
	
#КонецЕсли
